_sdaiGetEntityById(Sdai_instS*,System.Int32)
\details
Retrieves an application instance by its identifier
\param model [in] A model that owns the application instance.
\param id    [in] An entity identifier.
\returns An application instance represented by its STEP-identifier if the entity was found; otherwise, the function returns the NULL pointer.